# DistanceFromPreviousOrSpace Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterInfo..::..DistanceFromPreviousOrSpace Property
BalusterInfo Class See Also
---
The length, in case of balusters, it is a distance from a previous one. For a post, it is a space from the original position of the post.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public double DistanceFromPreviousOrSpace { get; set; }
```

Visual Basic
---
```text
Public Property DistanceFromPreviousOrSpace As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double DistanceFromPreviousOrSpace {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for distanceFromPreviousOrSpace is not finite |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for distanceFromPreviousOrSpace must be greater than 0 and no more than 30000 feet. |

# See Also
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace